plateFinHeatExchanger/constant/fins/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fins/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    base_fins
    {
        type            patch;
        nFaces          1838;
        startFace       580665;
    }
    fins_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          32199;
        startFace       582503;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_fins;
    }
    fins_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          241;
        startFace       614702;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_fins;
    }
)

// ************************************************************************* //
