plateFinHeatExchanger/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_fluid
    {
        type            patch;
        nFaces          172;
        startFace       791465;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          154;
        startFace       791637;
    }
    walls_fluid
    {
        type            patch;
        nFaces          6333;
        startFace       791791;
    }
    fluid_to_fins
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          32199;
        startFace       798124;
        sampleMode      nearestPatchFace;
        sampleRegion    fins;
        samplePatch     fins_to_fluid;
    }
)

// ************************************************************************* //
